sobomax/freebsd14_vendor/share/man/man9/VOP_STRATEGY.9
.\" -*- nroff -*-
.\"
.\" Copyright (c) 1996 Doug Rabson
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD: 6600b8e921d5e1c75a624bb2fb2893c5870107c6 $
.\"
.Dd June 30, 2022
.Dt VOP_STRATEGY 9
.Os
.Sh NAME
.Nm VOP_STRATEGY
.Nd read or write a file system buffer
.Sh SYNOPSIS
.In sys/param.h
.In sys/buf.h
.In sys/vnode.h
.Ft int
.Fn VOP_STRATEGY "struct vnode *vp" "struct buf *bp"
.Sh DESCRIPTION
The arguments are:
.Bl -tag -width 2n
.It Fa vp
The vnode that the buffer is for.
.It Fa bp
The buffer to be read or written.
.El
.Pp
This call either reads or writes data from a file, depending on the value of
.Fa bp->b_iocmd .
.Pp
The call may block.
.Sh RETURN VALUES
Always zero.
Errors should be signalled by setting the
.Dv BIO_ERROR
bit in
.Fa bp->b_ioflags
and setting
.Fa bp->b_error
to the appropriate
.Va errno
value.
.Sh SEE ALSO
.Xr errno 2 ,
.Xr buf 9 ,
.Xr vnode 9
.Sh AUTHORS
This manual page was written by
.An Doug Rabson .
